import { Link } from "react-router-dom";

export const Home = () => (
  <>
    <ul>
      <li>
        <Link to="/profile"> Go to Profile</Link>
      </li>
    </ul>
    <h1>Home</h1>
    <ul>
      <h2>New</h2>
      <li>
        <div>
          <img
            src="https://static.hdrezka.ac/i/2023/4/16/ycb7b86470dc1gm74d53i.jpg"
            alt="film1"
            style={{
              width: "100px",
              height: "100px",
            }}
          />
        </div>
        <p>Переводчик / Завет. Фильм Гая Ричи</p>
        <p>19 апреля 2023 года</p>
        <p>
          Во время войны в Афганистане морской пехотинец Джон Кинли вербует в
          качестве переводчика местного жителя Ахмеда, который презирает талибов
          из-за убийства своего сына. Когда Кинли вместе с отрядом попадает в
          засаду и оказывается тяжело раненым, переводчик идет на большой риск и
          титанические усилия, чтобы его спасти. После эвакуации армии США из
          Афганистана Ахмеду отказывают в визе, оставив его вместе с семьей на
          произвол судьбы. Чувство долга побуждает главного героя в одиночку
          вернуться в зону боевых действий, чтобы спасти товарища.
        </p>
      </li>
      <li>
        {" "}
        <div>
          <img
            src="https://static.hdrezka.ac/i/2023/7/26/d144367f02292ng52o27s.jpg"
            alt="film1"
            style={{
              width: "100px",
              height: "100px",
            }}
          />
        </div>
        <p>Name: Стефен Карри: Недооцененный</p>
        <p>Date: 23 января 2023 года</p>
        <p>
          Description: История становления одного из самых талантливых,
          динамичных и непредсказуемых игроков в НБА — американского
          баскетболиста Стивена Карри. Его профессиональный путь начинается в
          2008 году, когда Карри, будучи низкорослым игроком баскетбольной
          команды колледжа в Северной Каролине, становится игроком года и
          устанавливает рекорд по количеству заброшенных трехочковых в NCAA,
          после чего он был выбран «Голден Стэйт Уорриорз» на драфте. С этого
          момента спортивная карьера Стивена переживает серию взлетов, а он
          проходит путь от скромного провинциала до легенды мира
          профессионального баскетбола и четырехкратного чемпиона НБА.
        </p>
      </li>
      <li>
        {" "}
        <div>
          <img
            src="https://static.hdrezka.ac/i/2023/5/12/g3a01c260dbddij21z20z.png"
            alt="film1"
            style={{
              width: "100px",
              height: "100px",
            }}
          />
        </div>
        <p>Name: Неизменный: Майкл Дж. Фокс</p>
        <p>Date: 20 января 2023 года</p>
        <p>
          Description:Документальный фильм о жизненном пути американского актера
          Майкла Джей Фокса. Будучи низкорослым ребенком, выросшим на канадской
          военной базе, Майкл начинает собственный путь к успеху в качестве
          талантливого актера, который обретает мировую популярность в 1980-х
          годах, когда он получает главную роль в трилогии «Назад в будущее». На
          фоне ошеломительного успеха в профессиональной деятельности Майкл Джей
          Фокс начинает испытывать некоторые проблемы со здоровьем, после чего в
          1990 году ему ставят неутешительный диагноз — болезнь Паркинсона. С
          этого момента привычная жизнь успешного актера начинает кардинально
          меняться…
        </p>
      </li>
      <li>
        {" "}
        <div>
          <img
            src="https://static.hdrezka.ac/i/2023/5/3/z840c53e354e8sz70s98e.jpg"
            alt="film1"
            style={{
              width: "100px",
              height: "100px",
            }}
          />
        </div>
        <p>Кунг-фу жеребец</p>
        <p> 7 апреля 2023 года</p>
        <p>
          Лао Луо — опытный, но неудачливый каскадер, который работает в тандеме
          со своим конем по кличке «Огонек», развлекая публику на улице.
          Серьезная травма 8 лет назад разрушила его карьеру в киноиндустрии и
          оставила без гроша в кармане. Мало того, он развелся со своей женой и
          утратил опеку над дочерью, которая выросла и теперь учится на адвоката
          в университете. Все круто меняется, когда Лао Луо вместе с конем
          вступает в драку со сборщиками долгов и моментально становится звездой
          интернета, получив шанс изменить свою жизнь к лучшему.
        </p>
      </li>
      <li>
        {" "}
        <div>
          <img
            src="https://static.hdrezka.ac/i/2023/8/3/f6692c1729f1bil76w20z.jpg"
            alt="film1"
          />
        </div>
        <p>Кухня со звездами</p>
        <p> 16 января 2023 года</p>
        <p>
          Язид — выходец из неблагополучной семьи, который впоследствии был
          разлучен с родителями и оказался в детском приюте. Несмотря на
          многочисленные неурядицы и неприятности, с которыми подросток
          сталкивается в жизни, он продолжает преследовать заветную мечту:
          добиться высокого уровня мастерства в качестве профессионального
          кондитера. На пути к исполнению долгожданной мечты Язида ждет
          множество испытаний, включая конфликты с местными хулиганами и
          директором приюта. Но однажды юноше улыбается удача, когда он
          привлекает внимание шеф-повара мирового уровня и попадает к нему на
          кухню...
        </p>
      </li>
    </ul>
    <ul>
      <h2>Netflix</h2>
      <li>
        <div>
          <img
            src="https://static.hdrezka.ac/i/2023/6/22/df69eb576bcc7gg33i24u.jpg"
            alt=""
          />
        </div>
        <p>Черное зеркало</p>
        <p>4 декабря 2011 года</p>
        <p>
          В наше время технологии изменили нашу жизнь и общество в целом. Сейчас
          уже в каждом доме есть телевизор, монитор компьютера, и даже уходя, мы
          берем с собой телефон, смартфон или планшет – черное зеркало
          существовании человека в двадцать первом веке. Социальным сетям мы
          доверяем больше чем родным и близким, имеем доступ к любой информации,
          но правда нас хватает лишь на примитивное сообщение. В этом сериале
          показано беспокойство за нынешний мир, а «Черное зеркало» все
          отображает.
        </p>
      </li>
      <li>
        <div>
          <img src="" alt="" />
        </div>
        <p></p>
        <p></p>
        <p></p>
      </li>
      <li>
        <div>
          <img src="" alt="" />
        </div>
        <p></p>
        <p></p>
        <p></p>
      </li>
      <li>
        <div>
          <img src="" alt="" />
        </div>
        <p></p>
        <p></p>
        <p></p>
      </li>
      <li>
        <div>
          <img src="" alt="" />
        </div>
        <p></p>
        <p></p>
        <p></p>
      </li>
    </ul>
  </>
);
